import React from 'react'
import Title from '../components/Title'
import NewsLetter from '../components/NewsLetter'
import { assets } from '../assets/assets'


const About = () => {
  return (
    <div className='mx-auto container'>
      <div className="my-0 sm:py-20 lg:py-28 flex flex-col md:flex-row gap-16 text-center">
        <img className='w-full md:max-w-[450px]' src={assets.about_img} alt="" />
        <div className="md:w-2/4 text-gray-600 px-2 lg:px-0">
          <h1 className='text-3xl text-gray-800'>Who We Are</h1>
          <p className='text-sm text-justify mb-5'>GloreBD-এ আপনাকে স্বাগতম! আমরা বাংলাদেশের একটি গর্বিত ব্র্যান্ড।
            আমাদের যাত্রা শুরু হয়েছিল একটি স্বপ্ন নিয়ে—নারীদের জন্য এমন ফ্যাশন সরবরাহ করা যা মান, আভিজাত্য এবং আরামের প্রতিশ্রুতি দেয়। <span className="text-black">GloreBD</span> সেই চাহিদা পূরণে প্রতিশ্রুতিবদ্ধ। আমাদের মূল লক্ষ্য হলো ফ্যাশন ও আরামকে একসাথে নিয়ে এসে এমন পোশাক তৈরি করা যা প্রতিটি নারীর ব্যক্তিত্ব ও সৌন্দর্যকে আরও উজ্জ্বল করে তোলে। আমাদের যাত্রায় অংশ নিন এবং নিজেকে সাজান অনন্যভাবে। আপনার ফ্যাশন, আপনার পরিচয় <span className="text-black">GloreBD</span> এর সাথে।</p>
          <h1 className='text-xl text-gray-800'>✨ GloreBD-এর সাথে ফ্যাশনে পা রাখুন নতুন দিগন্তে! ✨</h1>
          <p className='text-sm text-justify mb-5'>আমাদের এক্সক্লুসিভ নতুন কালেকশন এখন উপলব্ধ! আপনার প্রিয় ফ্যাশন স্টাইল খুঁজে নিন আর নিজেকে সাজান অনন্যভাবে। ❤️

            আমাদের তিন পিস কালেকশন সাজানো হয়েছে আধুনিক ট্রেন্ড ও ঐতিহ্যের মিশেলে। প্রতিটি পোশাক এমনভাবে ডিজাইন করা হয়েছে যাতে এটি শুধু সুন্দর দেখায় না, বরং আরামদায়কও হয়। আমরা আমাদের প্রতিটি প্রোডাক্টের মান ও ফিনিশিং নিশ্চিত করতে সর্বোচ্চ যত্ন নিয়ে কাজ করি।

            আমাদের ফ্যাব্রিক নির্বাচন থেকে শুরু করে সেলাই পর্যন্ত প্রতিটি ধাপ পেশাদার ও মনোযোগী। প্রতিদিনের ব্যবহারের জন্য সহজলভ্য ডিজাইন থেকে উৎসবের জন্য ঝলমলে ডিজাইন পর্যন্ত আমাদের কালেকশনে রয়েছে সবকিছু। আমাদের কালেকশন আপনাকে দেবে ফ্যাশনের আধুনিকতা এবং ঐতিহ্যের একটি নিখুঁত সংমিশ্রণ।</p>
          <h1 className='text-xl text-gray-800'>✨ আপনার স্টাইল, আপনার পরিচয়! ✨</h1>
          <p className='text-sm text-justify mb-5'>GloreBD-এ আপনি পাবেন এমন পোশাক যা আপনার আত্মবিশ্বাস বাড়াবে এবং আপনাকে নতুনভাবে তুলে ধরবে। আমরা জানি, আপনার স্টাইল শুধু আপনার সৌন্দর্যের প্রকাশ নয়, এটি আপনার আত্মবিশ্বাসেরও প্রতিফলন।

            আমাদের পেছনের দলটি গঠিত হয়েছে প্যাশনেট ডিজাইনার, দক্ষ ক্রাফটসম্যান এবং নিবেদিত ব্যবস্থাপকদের দ্বারা, যারা প্রতিটি পোশাককে নিখুঁতভাবে তৈরি করতে কঠোর পরিশ্রম করেন। আমাদের দল নারীদের চাহিদা বুঝতে সক্ষম এবং সেই অনুযায়ী নতুন ডিজাইন নিয়ে আসতে সর্বদা আগ্রহী।

            আমাদের প্রোডাক্ট ও সার্ভিস নিয়ে আরও জানতে, অথবা আমাদের সাথে আপনার মতামত ভাগ করে নিতে, আপনি যেকোনো সময় আমাদের সাথে যোগাযোগ করতে পারেন।</p>
        </div>
      </div>
      <div className="text-xl py-4 px-2 lg:px-0 ">
        <Title text1={'WHY'} text2={'CHOOSE US'} />
      </div>

      <div className='flex flex-col lg:flex-row text-sm mb-20 px-2 lg:px-0 '>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>গুণগত মান নিশ্চিতকরণ:</b>
          <p className='text-gray-600'>আমরা প্রতিটি পণ্য সাবধানে নির্বাচন ও যাচাই করি, যাতে এটি আমাদের কঠোর মান নিয়ন্ত্রণের মাপকাঠি পূরণ করে।</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>সুবিধা:</b>
          <p className='text-gray-600'>আমাদের ব্যবহারকারী-বান্ধব ইন্টারফেস এবং ঝামেলামুক্ত অর্ডার প্রক্রিয়ার মাধ্যমে কেনাকাটা এখন আগের যেকোনো সময়ের চেয়ে সহজ।</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>অসাধারণ গ্রাহক সেবা:</b>
          <p className='text-gray-600'>আমাদের নিবেদিত পেশাদারদের দল সবসময় আপনার পাশে রয়েছে। আপনার সন্তুষ্টি নিশ্চিত করাই আমাদের সর্বোচ্চ অগ্রাধিকার।</p>
        </div>
      </div>
      <NewsLetter />
    </div>
  )
}

export default About